# Salaries

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salaries_18.csv')

In [3]:
salary.dtypes

name      object
salary    object
dtype: object

In [4]:
salary['salary'] = salary['salary'].str.replace('$', '').copy()

In [5]:
salary['salary'] = salary['salary'].str.replace(',', '').astype('int64').copy()

In [6]:
salary.dtypes

name      object
salary     int64
dtype: object

In [7]:
salary.rename(columns = {'name':'NAME'}, inplace = True)

In [8]:
salary.set_index('NAME', inplace = True)

In [9]:
salary.to_csv('../Capstone_csv_file/salary_edited_to_fit_18-19')

In [10]:
salary

                      salary
NAME
Aaron Rodgers       33500000
Matt Ryan           30000000
Kirk Cousins        28000000
Jimmy Garoppolo     27500000
Matthew Stafford    27000000
...                      ...
Dakota Dozier         880000
Jonotthan Harrison    880000
Phillip Gaines        880000
Paul Worrilow         880000
Richard Rodgers       880000

[1000 rows x 1 columns]